tutorials/compressible/realFluidPisoFoam/ras/cavity_IAPWS97/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     realFluidPisoFoam;

startFrom       latestTime;

stopAt          endTime;

endTime         0.5;

deltaT          1e-5;

writeControl    runTime;

writeInterval   0.1ls
;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1e-3;

runTimeModifiable yes;

//CL: load libraries need for the water properties
libs
(
    "libIAPWSThermo.so"
    "libfreesteam.so"
);


// ************************************************************************* //
