tutorials/compressible/realFluidPisoFoam/ras/cavity_IAPWS97/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
 default         cellMDLimited Gauss linear 0.333;
 grad(p)         cellMDLimited Gauss linear 0.333;
}

divSchemes
{
    default         Gauss linear;
    div(phi,U)      Gauss limitedLinearV 0.5;
    div(phid,p)     Gauss limitedLinear  0.5;
    div(phiU,p)     Gauss limitedLinear  0.5;
    div(phi,h)      Gauss limitedLinear  0.5;
    div(phi,k)      Gauss limitedLinear  0.5;
    div(phi,epsilon) Gauss limitedLinear 0.5;
    div(phi,R)      Gauss limitedLinear 0.5;
    div(phi,omega)  Gauss limitedLinear  0.5;;
    div(U)          Gauss limitedLinear  0.5;
    div((muEff*dev2(grad(U).T()))) Gauss linear;

}

laplacianSchemes
{
    default         none;
    laplacian(muEff,U) Gauss linear corrected;
    laplacian(mut,U) Gauss linear corrected;
    laplacian(DkEff,k) Gauss linear corrected;
    laplacian(DepsilonEff,epsilon) Gauss linear corrected;
    laplacian(DREff,R) Gauss linear corrected;
    laplacian(DomegaEff,omega) Gauss linear corrected;
    laplacian((rho*(1|A(U))),p) Gauss linear corrected;
    laplacian(alphaEff,h) Gauss linear corrected;

}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
}


// ************************************************************************* //
